# essential
brew "zsh" # my favorite shell interface
brew "bash" # use latest bash
brew "tmux" # terminal multiplexer
brew "neovim" # my favorite editor
brew "asdf" # extandable version manager
brew "starship" # cross-shell prompt
brew "fzf" # A command-line fuzzy finder
brew "direnv" # auto loading env per dir
brew "htop" # resource monitoring
brew "gpg" # GnuPG
brew "wget" # useful for downloading files

# viewer
brew "exa" # modern ls
brew "bat" # cat with wings
brew "glow" # markdown render on cli
brew "lf" # terminal file manager
brew "fx" # json viewer

# search
brew "rg" # modern grep
brew "the_silver_searcher" # another modern grep
brew "fasd" # Command-line productivity booster, offers quick access to files and directories
brew "fd" # mordern find

# helper
brew "tig" # git helper
brew "tldr" # Simplified and community-driven man pages
brew "watch" # execute a program periodically
brew "entr" # Run arbitrary commands when files change
brew "taskell" # CLI kanban
brew "fpp" # for tmux-fpp
brew "extract_url" # for tmux-urlview
brew "jq" # json processor

# misc
brew "neofetch"

# not core tap
brew "kdabir/tap/has"
